{
  "acardionItems": [
    {
      "a": "Which country is considered the birthplace of roses",
      "b": "Rose — collective name of species and varieties of representatives of the genus Rosehip (lat. Rósa) grown by humans. Most varieties of roses are obtained as a result of long-term selection through repeated repeated crosses and selection."
    },
    {
      "a": "What flower is called the divine flower, the «flower of Zeus»?",
      "b": "«The divine flower», or «flower of Zeus», is called the carnation (Dianthus).The name Dianthus comes from the Greek words dios — «divine» and anthos — «flower», that is, literally — «divine flower» or «flower Zeus» (Zeus — supreme god in ancient Greek mythology).Carnation has long symbolized love, courage and devotion, and in ancient times it was considered a flower dedicated to the gods of Olympus."
    },
    {
      "a": "What is the symbolic meaning of a rose?",
      "b": "Rose — is one of the oldest and richest symbols in world culture. Its meaning varies depending on the color, number of petals and context, but in general it represents love, beauty, mystery and spiritual rebirth."
    },
    {
      "a": "Are the prices and availability on your site up to date?",
      "b": "Prices and availability may vary — please contact directly to clarify"
    },
    {
      "a": "Where is the guarantee that you are not fraudsters, and if I make a prepayment, I will receive the paid product?",
      "b": "We are a legitimate company, provide all details, contract or invoice, and also use a payment system with buyer protection; if necessary, we can show reviews and documents."
    },
    {
      "a": "I paid for the order by transferring money to a bank card, what's next?",
      "b": "After transferring money to your account: we create your order, send it, and you receive a message with a track number; upon delivery, pay according to the agreement."
    },
    {
      "a": "Do you work with wholesale buyers? What are the terms/discounts?",
      "b": "Yes, we work with wholesale buyers — conditions depend on the volume of the order; discounts, individual prices — are discussed after specifying the quantity and product."
    }
  ]
}
