import css from "./DeliveryInfo.module.css";

export const DeliveryInfo = () => {
  return (
    <section className={css.deliveryInfo}>
      <h2 className={css.deliveryTitle}>
        🌸 Умови створення та доставки букетів 🌸
      </h2>

      <p className={css.deliveryText}>
        Наші букети створюються з максимальною увагою до деталей і любов’ю —
        кожна композиція повторює оригінал на фото настільки, наскільки це
        можливо. Проте, оскільки кожен букет виготовляється вручну нашими
        флористами, можливі легкі відмінності у формі чи розташуванні квітів.
      </p>

      <p className={css.deliveryText}>
        Іноді, залежно від сезонності або наявності певних квітів у вашому
        регіоні, ми можемо замінити окремі елементи на рівноцінні за якістю,
        зовнішнім виглядом і вартістю. Це дозволяє нам виконати ваше замовлення
        без затримок і зберегти красу кожного букета.
      </p>

      <div className={css.deliveryBlock}>
        <h3 className={css.deliverySubtitle}>🚚 Доставка:</h3>
        <ul className={css.deliveryList}>
          <li>
            По Україні — доставка можлива
            <strong>в день оформлення та оплати замовлення</strong>.
          </li>
          <li>
            Для країн дальнього зарубіжжя —
            <strong>через 2–3 робочі дні після оплати</strong>.
          </li>
        </ul>
      </div>

      <p className={css.deliveryText}>
        Під час оформлення замовлення ви побачите найближчу доступну дату й час
        доставки, з урахуванням обраного міста.
      </p>

      <p className={css.deliveryText}>
        💐 <strong>Рекомендуємо</strong> робити замовлення заздалегідь, особливо
        у святкові дні — тоді ми зможемо гарантувати своєчасну доставку вашого
        букета.
      </p>

      <p className={css.deliveryText}>
        Більш детальну інформацію можна знайти на сторінці оформлення
        замовлення.
      </p>
    </section>
  );
};
